sterentev/atdf-device-asm-include/inc/ATtiny20.inc
;***********************************************************************
;***** THIS IS A MACHINE GENERATED FILE - DO NOT EDIT ******************
;*************** Script version: 0.07 **********************************
;*************** tab-width 8 *******************************************
;***********************************************************************
;
;* Target MCU        : ATtiny20
;* Title             : Register/Mask/Bit Definitions for the ATtiny20
;* File Name         : ATtiny20.inc
;* Source Date       : 2026-04-11 12:34:00 UTC
;* Make Date         : 2026-06-01 12:44:39 UTC
;
;***********************************************************************

#ifndef _ATTINY20_INC_
#define _ATTINY20_INC_

;***********************************************************************
;********************* NOTES *******************************************
;***********************************************************************
;
; - Registers marked [MEMORY MAPPED] are extended I/O ports
;   and cannot be used with IN/OUT instructions
; - Register bits are specified by a bit number (for a single bit)
;   xor by mask (for bits group). In case bits in a group are placed sequentially
;   to each other (no gaps) a number for the lower bit in the group is defined also.
; - When a set of bitmask values is listed for bits group,
;   use those values without bit shifting operation
; - Some bitmasks MCU developers split on 2+ chunks and placed separately
;   (sometime in different registers). Such bitmaps are placed in
;   'EXTRA BITFIELDS VALUES' section. Refer to docs where such bits should be set.
; - FUSES and LOCKBITS in program skeleton are set to their production default values.
;
;***********************************************************************




; **********************************************************************
; ***************	DEVICE DEFINITIONS	************************
; **********************************************************************
;
.device	ATtiny20
.equ	SIGNATURE0	= 0x1e
.equ	SIGNATURE1	= 0x91
.equ	SIGNATURE2	= 0x0f


; ************* CPU REGISTERS DEFINITIONS ******************************
;
.def	XH	= r27
.def	XL	= r26
.def	YH	= r29
.def	YL	= r28
.def	ZH	= r31
.def	ZL	= r30



; **********************************************************************
; ***************	ADDR SPACES AND MAPPING	************************
; **********************************************************************
;
; ----------	PROG ADDRESS SPACE		------------------------
;   FLASH
.equ	ADDR_FLASH_START		= 0x0000
.equ	ADDR_FLASH_END			= 0x07FF
.equ	ADDR_FLASH_SIZE			= 0x0800

; ----------	SIGNATURES ADDRESS SPACE	------------------------
;   SIGNATURES
.equ	ADDR_SIGNATURES_START		= 0x0000
.equ	ADDR_SIGNATURES_END		= 0x0002
.equ	ADDR_SIGNATURES_SIZE		= 0x0003

; ----------	FUSES ADDRESS SPACE		------------------------
;   FUSES
.equ	ADDR_FUSES_START		= 0x0000
.equ	ADDR_FUSES_END			= 0x0000
.equ	ADDR_FUSES_SIZE			= 0x0001

; ----------	LOCKBITS ADDRESS SPACE		------------------------
;   LOCKBITS
.equ	ADDR_LOCKBITS_START		= 0x0000
.equ	ADDR_LOCKBITS_END		= 0x0000
.equ	ADDR_LOCKBITS_SIZE		= 0x0001

; ----------	DATA ADDRESS SPACE		------------------------
;   IO
.equ	ADDR_IO_START			= 0x0000
.equ	ADDR_IO_END			= 0x003F
.equ	ADDR_IO_SIZE			= 0x0040
;   SRAM
.equ	ADDR_SRAM_START			= 0x0040
.equ	ADDR_SRAM_END			= 0x00BF
.equ	ADDR_SRAM_SIZE			= 0x0080
;   MAPPED_NVM_LOCK_BITS
.equ	ADDR_MAPPED_NVM_LOCK_BITS_START	= 0x3F00
.equ	ADDR_MAPPED_NVM_LOCK_BITS_END	= 0x3F01
.equ	ADDR_MAPPED_NVM_LOCK_BITS_SIZE	= 0x0002
;   MAPPED_CONFIGURATION_BITS
.equ	ADDR_MAPPED_CONFIGURATION_BITS_START= 0x3F40
.equ	ADDR_MAPPED_CONFIGURATION_BITS_END= 0x3F41
.equ	ADDR_MAPPED_CONFIGURATION_BITS_SIZE= 0x0002
;   MAPPED_CALIBRATION_BITS
.equ	ADDR_MAPPED_CALIBRATION_BITS_START= 0x3F80
.equ	ADDR_MAPPED_CALIBRATION_BITS_END= 0x3F81
.equ	ADDR_MAPPED_CALIBRATION_BITS_SIZE= 0x0002
;   MAPPED_DEVICE_ID_BITS
.equ	ADDR_MAPPED_DEVICE_ID_BITS_START= 0x3FC0
.equ	ADDR_MAPPED_DEVICE_ID_BITS_END	= 0x3FC3
.equ	ADDR_MAPPED_DEVICE_ID_BITS_SIZE	= 0x0004
;   MAPPED_FLASH
.equ	ADDR_MAPPED_FLASH_START		= 0x4000
.equ	ADDR_MAPPED_FLASH_END		= 0x47FF
.equ	ADDR_MAPPED_FLASH_SIZE		= 0x0800

; ----------	OSCCAL ADDRESS SPACE		------------------------
;   OSCCAL
.equ	ADDR_OSCCAL_START		= 0x0000
.equ	ADDR_OSCCAL_END			= 0x0000
.equ	ADDR_OSCCAL_SIZE		= 0x0001




; **********************************************************************
; ***************	FUSES REGISTERS		************************
; **********************************************************************
;
.equ	BYTE0		= 0x00


; ====	FUSE MODULE REGISTERS BITS DEFINITION		========
;
; ----------	Register BYTE0 bits		------------------------
.equ	BODLEVEL_MASK	= 0x70		;      - Brown-out Detector trigger level (3 bits)
.equ	BODLEVEL0	= 4		;          BODLEVEL BIT0 position
.equ	CKOUT		= 2		; 0x04 - Output external clock
.equ	WDTON		= 1		; 0x02 - Watch dog timer always on
.equ	RSTDISBL	= 0		; 0x01 - Disable external reset
; ::::  BODLEVEL	:::: bitfield values
;			0x70		; Brown-out detection disabled; [BODLEVEL=111]
;			0x60		; Brown-out detection at VCC=1.8 V
;			0x50		; Brown-out detection at VCC=2.7 V
;			0x40		; Brown-out detection at VCC=4.3 V




; **********************************************************************
; ***************	LOCKBITS REGISTERS	************************
; **********************************************************************
;
.equ	LOCKBIT		= 0x00


; ====	LOCKBIT MODULE REGISTERS BITS DEFINITION	========
;
; ----------	Register LOCKBIT bits		------------------------
.equ	LB_MASK		= 0x03		;      - Memory Lock (2 bits)
.equ	LB0		= 0		;          LB BIT0 position
; ::::  LB	:::: bitfield values
;			0x00		; Further programming and verification disabled
;			0x02		; Further programming disabled
;			0x03		; No memory lock features enabled




; **********************************************************************
; ***************	DATA REGISTERS		************************
; **********************************************************************
;
.equ	SREG		= 0x3F		; Status Register
.equ	SP		= 0x3D		; Stack Pointer 
.equ	CCP		= 0x3C		; Configuration Change Protection
.equ	RSTFLR		= 0x3B		; Reset Flag Register
.equ	MCUCR		= 0x3A		; MCU Control Register
.equ	OSCCAL		= 0x39		; Oscillator Calibration Value
.equ	CLKMSR		= 0x37		; Clock Main Settings Register
.equ	CLKPSR		= 0x36		; Clock Prescale Register
.equ	PRR		= 0x35		; Power Reduction Register
.equ	NVMCMD		= 0x33		; Non-Volatile Memory Command
.equ	NVMCSR		= 0x32		; Non-Volatile Memory Control and Status Register
.equ	WDTCSR		= 0x31		; Watchdog Timer Control and Status Register
.equ	SPCR		= 0x30		; SPI Control Register
.equ	SPSR		= 0x2F		; SPI Status Register
.equ	SPDR		= 0x2E		; SPI Data Register
.equ	TWSCRA		= 0x2D		; TWI Slave Control Register A
.equ	TWSCRB		= 0x2C		; TWI Slave Control Register B
.equ	TWSSRA		= 0x2B		; TWI Slave Status Register A
.equ	TWSA		= 0x2A		; TWI Slave Address Register
.equ	TWSAM		= 0x29		; TWI Slave Address Mask Register
.equ	TWSD		= 0x28		; TWI Slave Data Register
.equ	GTCCR		= 0x27		; General Timer/Counter Control Register
.equ	TIMSK		= 0x26		; Timer Interrupt Mask Register
.equ	TIFR		= 0x25		; Overflow Interrupt Enable
.equ	TCCR1A		= 0x24		; Timer/Counter1 Control Register A
.equ	TCCR1B		= 0x23		; Timer/Counter1 Control Register B
.equ	TCCR1C		= 0x22		; Timer/Counter1 Control Register C
.equ	TCNT1		= 0x20		; Timer/Counter1 
.equ	OCR1A		= 0x1E		; Timer/Counter 1 Output Compare Register A 
.equ	OCR1B		= 0x1C		; Timer/Counter1 Output Compare Register B 
.equ	ICR1		= 0x1A		; Input Capture Register  Bytes
.equ	TCCR0A		= 0x19		; Timer/Counter 0 Control Register A
.equ	TCCR0B		= 0x18		; Timer/Counter 0 Control Register B
.equ	TCNT0		= 0x17		; Timer/Counter0
.equ	OCR0A		= 0x16		; Timer/Counter0 Output Compare Register
.equ	OCR0B		= 0x15		; Timer/Counter0 Output Compare Register
.equ	ACSRA		= 0x14		; Analog Comparator Control And Status Register A
.equ	ACSRB		= 0x13		; Analog Comparator Control And Status Register B
.equ	ADCSRA		= 0x12		; The ADC Control and Status register
.equ	ADCSRB		= 0x11		; ADC Control and Status Register B
.equ	ADMUX		= 0x10		; The ADC multiplexer Selection Register
.equ	ADC		= 0x0E		; ADC Data Register  Bytes
.equ	DIDR0		= 0x0D		; Digital Input Disable Register 0
.equ	GIMSK		= 0x0C		; General Interrupt Mask Register
.equ	GIFR		= 0x0B		; General Interrupt Flag Register
.equ	PCMSK1		= 0x0A		; Pin Change Mask Register 1
.equ	PCMSK0		= 0x09		; Pin Change Mask Register 0
.equ	PORTCR		= 0x08		; Port Control Register
.equ	PUEB		= 0x07		; Pull-up Enable Control Register
.equ	PORTB		= 0x06		; Input Pins, Port B
.equ	DDRB		= 0x05		; Data Direction Register, Port B
.equ	PINB		= 0x04		; Port B Data register
.equ	PUEA		= 0x03		; Pull-up Enable Control Register
.equ	PORTA		= 0x02		; Port A Data Register
.equ	DDRA		= 0x01		; Data Direction Register, Port A
.equ	PINA		= 0x00		; Port A Input Pins


