sterentev/atdf-device-asm-include/inc/ATtiny20.inc
; ----------	Register GTCCR bits		------------------------
;.equ	TSM		= 7		; 0x80 - Timer Synchronization Mode
;.equ	PSR		= 0		; 0x01 - Prescaler Reset



; ====	SPI MODULE REGISTERS BITS DEFINITION		========
;
; ----------	Register SPCR bits		------------------------
.equ	SPIE		= 7		; 0x80 - SPI Interrupt Enable
.equ	SPE		= 6		; 0x40 - SPI Enable
.equ	DORD		= 5		; 0x20 - Data Order
.equ	MSTR		= 4		; 0x10 - Master/Slave Select
.equ	CPOL		= 3		; 0x08 - Clock polarity
.equ	CPHA		= 2		; 0x04 - Clock Phase
.equ	SPR_MASK	= 0x03		;      - SPI Clock Rate Selects (2 bits)
.equ	SPR0		= 0		;          SPR BIT0 position
; ::::  SPR	:::: bitfield values
;			0x00		; fcl/4
;			0x01		; fcl/16
;			0x02		; fcl/64
;			0x03		; fcl/128

; ----------	Register SPSR bits		------------------------
.equ	SPIF		= 7		; 0x80 - SPI Interrupt Flag
.equ	WCOL		= 6		; 0x40 - Write Collision Flag
.equ	SPI2X		= 0		; 0x01 - Double SPI Speed Bit




; **********************************************************************
; ***************	EXTRA BITFIELDS VALUES	************************
; **********************************************************************
;
; ::::  INTERRUPT_SENSE_CONTROL	:::: values
;			0b00		; Low Level of INTX
;			0b01		; Any logical change on INTX
;			0b10		; Falling Edge of INTX
;			0b11		; Rising Edge of INTX



; **********************************************************************
; ***************	INTERRUPT VECTORS	************************
; **********************************************************************
;
.equ	INT_VECTORS_NUM		= 17
.equ	INT_VECTORS_SIZE	= 0x22
;
; ----------	INTERRUPT INDEXES		------------------------
;
;	0	RESET		; External Reset, Power-on Reset and Watchdog Reset
;	1	INT0		; External Interrupt Request 0
;	2	PCINT0		; Pin Change Interrupt Request 0
;	3	PCINT1		; Pin Change Interrupt Request 1
;	4	WDT		; Watchdog Time-out
;	5	TIM1_CAPT	; Timer/Counter1 Input Capture
;	6	TIM1_COMPA	;  Timer/Counter1 Compare Match A
;	7	TIM1_COMPB	;  Timer/Counter1 Compare Match B
;	8	TIM1_OVF	; Timer/Counter1 Overflow
;	9	TIM0_COMPA	; Timer/Counter0 Compare Match A
;	10	TIM0_COMPB	; Timer/Counter0 Compare Match B
;	11	TIM0_OVF	; Timer/Counter0 Overflow
;	12	ANA_COMP	; Analog Comparator
;	13	ADC_ADC		; Conversion Complete
;	14	TWI_SLAVE	; Two-Wire Interface
;	15	SPI		; Serial Peripheral Interface
;	16	QTRIP		; Touch Sensing



; **********************************************************************
; ***************	ASM PROGRAM SKELETON	************************
; **********************************************************************
;
;  Copy-paste following definitions into your code,
;  uncomment and modify for your needs
;
; ----------	 >>>   SKELETON BEGIN   <<<	------------------------
;#	.include "ATtiny20.inc"
;#	
;#	; FUSES BYTE0 byte (addr 0x00)
;#	.set	BODLEVEL	= 0x70	; Brown-out detection disabled; [BODLEVEL=111]
;#	.set	FUSES_BYTE0	= 0xFF \
;#				  &  (~BODLEVEL_MASK | BODLEVEL) \
;#				  & ~(0 <<CKOUT) \
;#				  & ~(0 <<WDTON) \
;#				  & ~(0 <<RSTDISBL)
;#	; LOCKBITS LOCKBIT byte (addr 0x00)
;#	.set	LB		= 0x03	; No memory lock features enabled
;#	.set	LOCKBITS_LOCKBIT= 0xFF \
;#				  &  (~LB_MASK | LB)
;#	.message "====================="
;#	.message "=====  Fuses  ======="
;#	.message "BYTE0		", FUSES_BYTE0
;#	.message "===== Lockbits ======"
;#	.message " LOCKBIT	", LOCKBITS_LOCKBIT
;#	.message "====================="
;#	
;#	.org 0x0000
;#	; Interrupt vectors begin
;#		rjmp	RESET		; RESET		 - External Reset, Power-on Reset and Watchdog Reset
;#		rjmp	INT0_ISR	; INT0		 - External Interrupt Request 0
;#		rjmp	PCINT0_ISR	; PCINT0	 - Pin Change Interrupt Request 0
;#		reti			; PCINT1	 - Pin Change Interrupt Request 1
;#		reti			; WDT		 - Watchdog Time-out
;#		reti			; TIM1_CAPT	 - Timer/Counter1 Input Capture
;#		reti			; TIM1_COMPA	 -  Timer/Counter1 Compare Match A
;#		reti			; TIM1_COMPB	 -  Timer/Counter1 Compare Match B
;#		reti			; TIM1_OVF	 - Timer/Counter1 Overflow
;#		reti			; TIM0_COMPA	 - Timer/Counter0 Compare Match A
;#		reti			; TIM0_COMPB	 - Timer/Counter0 Compare Match B
;#		reti			; TIM0_OVF	 - Timer/Counter0 Overflow
;#		reti			; ANA_COMP	 - Analog Comparator
;#		reti			; ADC_ADC	 - Conversion Complete
;#		reti			; TWI_SLAVE	 - Two-Wire Interface
;#		reti			; SPI		 - Serial Peripheral Interface
;#		reti			; QTRIP		 - Touch Sensing
;#	; Interrupt vectors end
;#	;.org INT_VECTORS_SIZE
;#	RESET:
;#		cli
;#		ldi	r16, high(ADDR_SRAM_END)
;#		out	SP+1, r16
;#		ldi	r16, low(ADDR_SRAM_END)
;#		out	SP, r16
; ----------	 >>>   SKELETON  END    <<<	------------------------

#endif /* _ATTINY20_INC_ */

; ************************ END OF FILE *********************************

